{
  "title": "Central Valley News",
  "img": "/central-valley-news.png",
  "url": "https://central-valley-news.netlify.app/news",
  "github": "https://github.com/Algorithm-Allies/valleyNews",
  "description": "Worked collaboratively with a team of seven to develop a centralized platform for aggregating articles from various publications. Implemented web scraping techniques to gather content, creating a convenient and comprehensive source of news and information for users.",
  "stack": ["React", "Node", "TailwindCSS", "Cheerio"],
  "learned": [
    {
      "title": "Webscraper",
      "content": [
        "I was part of a team that developed a sophisticated web scraper using Node.js, integrating the Cheerio library for parsing HTML and a cron job for scheduling tasks. This tool was specifically designed to scrape multiple news publications automatically, gathering updated content at predetermined intervals. By leveraging Cheerio, we efficiently extracted relevant data like headlines, images, and article content, which allowed us to handle large volumes of data with minimal overhead. The use of a cron job enabled the system to run autonomously, ensuring that our database was always filled with the latest news without manual intervention. This project not only honed my technical skills but also provided valuable insights into managing and manipulating large datasets in real-time."
      ]
    },
    {
      "title": "Agile Methodology",
      "content": [
        "Working with Agile methodology has fundamentally transformed my approach to project management and team collaboration. Agile emphasizes flexibility, continuous improvement, and the importance of feedback from all members. By breaking down projects into manageable units called sprints, we were  able to tackle complex tasks more efficiently and adapt quickly to changes. Regular  meetings ensured that team members wre aligned and can discuss challenges and progress in real-time"
      ]
    },
    {
      "title": "User Interface",
      "content": [
        "I played a pivotal role in crafting the user interface for this project using React's component-based architecture. Working closely with team members, I contributed to the development of interactive and dynamic UI components that elevated user experiences. Simultaneously, I collaborted with team members in utilizing Figma to translate conceptual ideas into  UI/UX designs. Through this collaborative effort, we delivered intuitive applications that seamlessly blend functionality with aesthetic appeal, ensuring alignment with user expectations and project goals."
      ]
    }
  ]
}
